#include "overlays/ovl_36.h"
#include "gcc/memory.h"
#include "game/esprite.h"
#include "game/hmfman.h"
#include "game/sprite.h"
#include "mallocblock.h"

#define FUNC_GRP_MAX 6
#define FUNC_PRIO_MAX 10
#define SPRITES_MAX 52
#define ANIMMDL_MAX 0

#define VECMagXZ(a) sqrtf(((a)->x*(a)->x)+((a)->z*(a)->z))
#define M_ID(m, i, j) ((m)[(i) * 4 + (j)])

// EXTERN

typedef struct {
    /* 0x00 */ char unk00[2];
    /* 0x02 */ s16 unk02;
    /* 0x04 */ char unk04[0x14];
} D_800CCF58_CDB58_Struct; // Size 0x18

extern D_800CCF58_CDB58_Struct* D_800CCF58_CDB58; // esprite

// 8EA10
f32 atan2d(f32, f32);

// 8EFF0
f32 HuMathCos(f32);

// 8FB20
f32 HuMathSin(f32);

// unknown
extern s16 D_800CDD6A_CE96A;
extern u8 D_800D2008_D2C08;

// LOCAL

typedef struct {
    u8 r;
    u8 g;
    u8 b;
    u8 a;
} RGBA;

typedef struct {
    /* 0x00 */ FuncContext* funcCtx;
    /* 0x04 */ s8 maxFuncs;
    /* 0x05 */ u8 sort;
    /* 0x06 */ s8 order[FUNC_PRIO_MAX];
} FuncGroup; // Size 0x10

#define SPRITE_STATE_NOTSET 0
#define SPRITE_STATE_INVISIBLE 1
#define SPRITE_STATE_VISIBLE 2

typedef struct {
    /* 0x00 */ s8 state;
    /* 0x01 */ u8 groupId;
    /* 0x02 */ u8 unk02;
    /* 0x04 */ u16 unk04;
    /* 0x06 */ s16 unk06;
} SpriteData; // Size 8

#define ANIMMDL_ATTR_DISPON 1

#define ANIMMDL_STATE_INVISIBLE -1
#define ANIMMDL_STATE_WAIT 0
#define ANIMMDL_STATE_ANIM 1

typedef struct {
    /* 0x00 */ s8 set;
    /* 0x04 */ s32 attr;
    /* 0x08 */ s8 state;
    /* 0x0A */ s16 modelId;
    /* 0x0C */ f32 freq;
    /* 0x10 */ f32 animTimer;
    /* 0x14 */ f32 animStart;
} AnimModelData; // Size 0x18

void m254_InitFuncGroup(FuncGroup* group, s16 maxFuncs);
void m254_SortFuncGroup(FuncGroup* group);
s16 func_80110A00_2AC490_motor_rooter(HuSprite_Unk84_Struct* arg0, HmfData* arg1, f32 arg2, u16 arg3, u16 arg4);

extern SpriteData* m254_sprites;
extern AnimModelData* m254_animModels;
extern FuncGroup* m254_funcGroups;

extern Gfx D_801135A0_2AF030_motor_rooter[];

void m254_CreateSystem(void) {
    s8 maxFuncs[FUNC_GRP_MAX] = { 4, 4, 4, 2, 8, 8 };
    s16 i;

    m254_sprites = HuMemAllocTag(SPRITES_MAX * sizeof(SpriteData), 31000);
    memset(m254_sprites, 0, SPRITES_MAX * sizeof(SpriteData));
    m254_funcGroups = HuMemAllocTag(FUNC_GRP_MAX * sizeof(FuncGroup), 31000);
    for (i = 0; i < FUNC_GRP_MAX; i++) {
        m254_InitFuncGroup(&m254_funcGroups[i], maxFuncs[i]);
    }
}

void m254_InitFuncGroup(FuncGroup* group, s16 maxFuncs) {
    s16 i;

    group->funcCtx = HuMemAllocTag(maxFuncs * sizeof(FuncContext), 31000);
