#include "ovl_39.h"

#define ABS(x) ((x) > 0 ? (x) : -(x))

// EXTERN

s32 func_80036C4C_3784C();

void Hu3DModelRotSet(s16, f32, f32, f32);
void* HuMemAllocTag(s32, s32);
s32 func_8000B638_C238(void);
s32 func_80017BB8_187B8(s32, s32);
f32 func_8001C7D0_1D3D0(s32);
s32 func_80037030_37C30(void);
void func_80045010_45C10(const s16*, s32);
void func_80045F1C_46B1C(s32, s32, s32);
void func_8004ABE8_4B7E8(s32, s32);
void func_8004AC10_4B810(s32, s32);
void func_8004AC98_4B898(s32, s16);
void func_8004AD50_4B950(s32);
void func_8004B25C_4BE5C(s16, s32, s32, s32);
void func_80054FF8_55BF8(s32, s32, s32);
void func_800E18D8_B4458_name_82(void);
void func_800E19F0_B4570_name_82(s32);
void func_800E1BA8_B4728_name_82(omObjData*, s32, s32, u16, s32, s32);
void func_800E4E30_B79B0_name_82(omObjData*);
void func_800E5690_B8210_name_82(omObjData*, u16);
void func_800E5A00_B8580_name_82(omObjData*, s32, s32, s32, s32);

extern s32 D_800A178C[][6];
extern s16 D_800EBE28_BE9A8_name_82;
extern s16 D_800EC1B8_BED38_name_82;
extern omObjData* D_800EC1C0_BED40_name_82;
extern u16 D_800EC280_BEE00_name_82;
extern omObjData* D_800EC598_BF118_name_82[];
extern s8 D_800CBB6E_CC76E[];
extern u16 D_800CDA7C_CE67C[];
extern f32 D_800CE1C8_CEDC8;
extern f32 D_800D138C_D1F8C[];
extern s8 D_800D20A1_D2CA1[];
extern f32 D_800D6ABC_D76BC[];

// LOCAL

typedef struct {
    /* 0x00 */ f32 unk00;
    /* 0x04 */ f32 unk04;
    /* 0x08 */ f32 unk08;
    /* 0x0C */ f32 unk0C;
    /* 0x10 */ s16 unk10;
    /* 0x12 */ s16 unk12;
    /* 0x14 */ s16 unk14;
    /* 0x16 */ s16 unk16;
    /* 0x18 */ s16 unk18;
    /* 0x1A */ s16 unk1A;
    /* 0x1C */ s16 unk1C;
    /* 0x1E */ s16 unk1E;
    /* 0x20 */ s16 unk20;
    /* 0x24 */ f32 unk24;
    /* 0x28 */ s8 unk28;
    /* 0x29 */ char unk29[0x33];
} D_8010E6E0_2C5B50_Struct; // Size 0x5C

void func_801059BC_2BCE2C_tick_tock_hop(void);
void func_80105B90_2BD000_tick_tock_hop(void);
void func_80105C9C_2BD10C_tick_tock_hop(omObjData* arg0);
void func_80105D1C_2BD18C_tick_tock_hop(omObjData* arg0);
void func_80105CE4_2BD154_tick_tock_hop(omObjData* arg0);
void func_80105E1C_2BD28C_tick_tock_hop(omObjData* arg0);
void func_80105FB4_2BD424_tick_tock_hop(omObjData* arg0);
void func_80105FF0_2BD460_tick_tock_hop(omObjData* arg0);
void func_80106504_2BD974_tick_tock_hop(omObjData* arg0);
void func_80106534_2BD9A4_tick_tock_hop(omObjData* arg0);
void func_801068D4_2BDD44_tick_tock_hop(omObjData* arg0);
void func_80106904_2BDD74_tick_tock_hop(D_8010E6F4_2C5B64_Unk00_Struct* arg0, D_8010E6F4_2C5B64_Unk04_Struct* arg1);
void func_80106980_2BDDF0_tick_tock_hop(D_8010E6F4_2C5B64_Unk00_Struct* arg0, D_8010E6F4_2C5B64_Unk04_Struct* arg1);
