#include "ovl_39.h"

#define M_ID(m, i, j) ((m)[(i) * 4 + (j)])

// EXTERN

typedef struct {
    /* 0x00 */ void* unk00;
    /* 0x04 */ u16 unk04;
    /* 0x06 */ u16 unk06;
    /* 0x08 */ char unk08[4];
} Func_80055194_55D94_Unk00_Struct; // Size 0xC

typedef struct {
    /* 0x00 */ Func_80055194_55D94_Unk00_Struct* unk00;
    /* 0x04 */ char unk04[4];
    /* 0x08 */ u8* unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s16 unk10;
    /* 0x12 */ char unk12[6];
    /* 0x18 */ u16 unk18;
    /* 0x1A */ u16 unk1A;
} Func_80055194_55D94_Struct; // Size unknown

typedef struct {
    /* 0x00 */ char unk00[0x10];
    /* 0x10 */ s16 unk10;
} Func_80055520_56120_Unk84_Struct;

typedef struct {
    /* 0x00 */ char unk00[0x84];
    /* 0x84 */ Func_80055520_56120_Unk84_Struct* unk84;
    /* 0x88 */ char unk88[8];
    /* 0x90 */ s16 unk90;
} Func_80055520_56120_Struct; // Size unknown

s32 SprAttrReset();
s32 SprAttrSet();

void Hu3DModelRotSet(s16, f32, f32, f32);
void* HuMemAlloc(s32);
void* HuMemAllocTag(s32, s32);
void HuMemFree(void*);
void* memcpy(void*, const void*, unsigned int);
void func_80017D24_18924(f32*, f32, f32, f32);
s32 func_8001A894_1B494(s32, Gfx*, s32);
void func_80054FF8_55BF8(s32, s32, s32);
Func_80055194_55D94_Struct* func_80055194_55D94(s32);
Func_80055520_56120_Struct* func_80055520_56120(s32, s32);
f32 func_8008E108_8ED08(f32, f32);

extern s16 D_800CDD6A_CE96A;
extern f32 D_800D138C_D1F8C[];
extern u8 D_800D1FF0_D2BF0;
extern u8 D_800D2008_D2C08;

// LOCAL

typedef struct {
    /* 0x00 */ s8 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ u8 unk08;
    /* 0x0A */ s16 unk0A;
    /* 0x0C */ s16 unk0C;
    /* 0x0E */ s16 unk0E;
    /* 0x10 */ f32* unk10;
    /* 0x14 */ f32* unk14;
    /* 0x18 */ f32* unk18;
} D_8010E6F0_2C5B60_Struct; // Size 0x1C

typedef struct {
    u8 r;
    u8 g;
    u8 b;
    u8 a;
} RGBA;

void func_80109F30_2C13A0_tick_tock_hop(D_8010E6F4_2C5B64_Struct* arg0);
s32 func_8010AD60_2C21D0_tick_tock_hop(Func_80055194_55D94_Struct* arg0, f32 arg1);
s32 func_8010B4D0_2C2940_tick_tock_hop(Func_80055194_55D94_Struct* arg0, f32 arg1);
void func_8010CCD4_2C4144_tick_tock_hop(u16 arg0, Func_80055194_55D94_Struct* arg1, u16 arg2);
s16 func_8010CED8_2C4348_tick_tock_hop(Func_80055194_55D94_Struct* arg0, HmfModelData_Unk64_Struct* arg1, f32 arg2, u16 arg3, u16 arg4);
void func_8010D5DC_2C4A4C_tick_tock_hop(D_8010E6F4_2C5B64_Unk00_Struct* arg0, D_8010E6F4_2C5B64_Unk04_Struct* arg1);
f32 func_8010D938_2C4DA8_tick_tock_hop(D_8010E700_2C5B70_Struct* arg0, D_8010E700_2C5B70_Unk98_Struct* arg1, Vec* arg2, Vec* arg3);
void func_8010DFB0_2C5420_tick_tock_hop(f32* arg0);
