#include "overlays/ovl_39.h"
#include "overlays/minigame.h"
#include "gcc/memory.h"
#include "game/audio.h"
#include "game/camera.h"
#include "game/gamemes.h"
#include "game/gamework_data.h"
#include "game/hmflight.h"
#include "game/pause.h"
#include "game/sprite.h"
#include "game/wipe.h"
#include "mallocblock.h"

#define PLAYERS_TOTAL 2
#define JUMPS_MAX 99

// C1F0
void func_8000B5F0_C1F0(u8 arg0);
s32 func_8000B638_C238(void);

// 14EA0
void func_800142A0_14EA0(s32);
s32 func_80017BB8_187B8(s32, s32);

// 20A20
void Hu3DAnimInit(s32);

// 8EFF0
f32 HuMathCos(f32);

// 8FB20
f32 HuMathSin(f32);

// pad
extern s8 D_800CBB6E_CC76E[];
extern u16 D_800CDA7C_CE67C[];
extern s8 D_800D20A1_D2CA1[];

// unknown
extern s32 D_800A178C[][6];
extern u16 D_800D530C_D5F0C;

// LOCAL

enum {
    FGRP_CAMERA,
    FGRP_MINIGAME,
    FGRP_CLOCK,
    FGRP_PLAYER_1,
    FGRP_PLAYER_2
};

enum {
    MDL_PLATFORM,
    MDL_OBSTACLE,
    MDL_DISK_SMALL,
    MDL_DISK_LARGE
};

enum {
    HAND_PLATFORM,
    HAND_OBSTACLE
};

typedef struct {
    /* 0x00 */ f32 clockHandRot[2];
    /* 0x08 */ f32 clockBaseSpeed[2];
    /* 0x10 */ s16 clockHandModel[2];
    /* 0x14 */ s16 tensSpriteId;
    /* 0x16 */ s16 unitsSpriteId;
    /* 0x18 */ s16 obstacleColliderId;
    /* 0x1A */ s16 obstacleProximityColliderId;
    /* 0x1C */ s16 jumpCount;
    /* 0x1E */ s16 jumpsSinceSpeedChange;
    /* 0x20 */ s16 jumpsForSpeedChange;
    /* 0x24 */ f32 clockSpeedMultiplier;
    /* 0x28 */ s8 finished;
    /* 0x2C */ Work work;
} MinigameData; // Size 0x5C

#define PLAYER_STAT_01 1
#define PLAYER_STAT_JUMPING 2
#define PLAYER_STAT_LOST 8
#define PLAYER_STAT_WON 0x10
#define PLAYER_STAT_FROZEN 0x20
#define PLAYER_STAT_FINISHED (PLAYER_STAT_LOST | PLAYER_STAT_WON)

#define PLAYER_STATE_IDLE 0
#define PLAYER_STATE_WALK 2
#define PLAYER_STATE_JUMP 6
#define PLAYER_STATE_WON 13
#define PLAYER_STATE_KNOCKED 14
#define PLAYER_STATE_LAND 21
#define PLAYER_STATE_LOST 38

typedef struct {
    /* 0x00 */ s16 padId;
    /* 0x02 */ s16 chr;
    /* 0x04 */ s32 stat;
    /* 0x08 */ s8 updateAnimation;
    /* 0x0A */ s16 state;
    /* 0x0C */ s16 nextState;
    /* 0x0E */ char unk0E[0x12];
    /* 0x20 */ s16 resetInputGroupId;
    /* 0x22 */ s16 resetInputId;
    /* 0x24 */ s16 unk24;
    /* 0x26 */ char unk26[0x1A];
    /* 0x40 */ ModelTracker* obstacleCollisionTracker;
    /* 0x44 */ ModelTracker* obstacleProximityTracker;
    /* 0x48 */ f32 accelY;
    /* 0x4C */ s16 comReactionDelay;
    /* 0x4E */ s16 comShortJumpBias;
    /* 0x50 */ s16 comFreezeThreshold;
    /* 0x52 */ s16 dustBillId;
    /* 0x54 */ char unk54[8];
} PlayerData; // Size 0x5C

void m257_InitEnvironment(void);
void m257_CreateMinigame(void);
void m257_CheckExitRequest(omObjData* object);
void m257_ExitOverlay(omObjData* object);
void m257_WaitExitWipeOut(omObjData* object);
void m257_InitMinigame(omObjData* object);
void m257_UpdateSystem(omObjData* object);
void m257_InitClock(omObjData* object);
void m257_UpdateClockHands(omObjData* object);
void m257_InitPlayer(omObjData* object);
void m257_UpdatePlayer(omObjData* object);
void m257_InitCamera(FuncGroupContext* groupCtx, FuncContext* ctx);
void m257_CheckMinigameEnd(FuncGroupContext* groupCtx, FuncContext* ctx);
void m257_ExecPlayersDraw(FuncGroupContext* groupCtx, FuncContext* ctx);
void m257_ExecClockIntro(FuncGroupContext* groupCtx, FuncContext* ctx);
void m257_UpdateClockSpeed(FuncGroupContext* groupCtx, FuncContext* ctx);
void m257_UpdateClockObstacleRotation(FuncGroupContext* groupCtx, FuncContext* ctx);
