#include "overlays/ovl_39.h"
#include "mallocblock.h"

#define PLAYERS_TOTAL 2
#define JUMPS_MAX 99

#define HAND_PLATFORM 0
#define HAND_OBSTACLE 1

#define MDL_PLATFORM 0
#define MDL_OBSTACLE 1
#define MDL_DISK_SMALL 2
#define MDL_DISK_LARGE 3

// C1F0
s32 func_8000B638_C238(void);

// 14EA0
s32 func_80017BB8_187B8(s32, s32);

// pause
void func_80045F1C_46B1C(s32, s32, s32);

// 4B120 (audio?)
void func_8004ABE8_4B7E8(s32, s32);
void func_8004AC10_4B810(s32, s32);
void func_8004AC98_4B898(s32, s16);
void func_8004AD50_4B950(s32);
void func_8004B25C_4BE5C(s16, s32, s32, s32);

// pad
extern s8 D_800CBB6E_CC76E[];
extern u16 D_800CDA7C_CE67C[];
extern s8 D_800D20A1_D2CA1[];

// ovl_82
void func_800E18D8_B4458_name_82(void);
void func_800E19F0_B4570_name_82(s32);
void func_800E1BA8_B4728_name_82(omObjData*, s32, s32, u16, s32, s32);
void func_800E4E30_B79B0_name_82(omObjData*);
void func_800E5690_B8210_name_82(omObjData*, u16);
void func_800E5A00_B8580_name_82(omObjData*, s32, s32, s32, s32);
extern s16 D_800EBE28_BE9A8_name_82;
extern s16 D_800EC1B8_BED38_name_82;
extern omObjData* D_800EC1C0_BED40_name_82;
extern u16 D_800EC280_BEE00_name_82;
extern omObjData* D_800EC598_BF118_name_82[];

// unknown
extern s32 D_800A178C[][6];

// LOCAL

typedef struct {
    /* 0x00 */ f32 clockHandRot[2];
    /* 0x08 */ f32 clockBaseSpeed[2];
    /* 0x10 */ s16 clockHandModel[2];
    /* 0x14 */ s16 tensSpriteId;
    /* 0x16 */ s16 unitsSpriteId;
    /* 0x18 */ s16 obstacleColliderId;
    /* 0x1A */ s16 obstacleProximityColliderId;
    /* 0x1C */ s16 jumpCount;
    /* 0x1E */ s16 jumpsSinceSpeedChange;
    /* 0x20 */ s16 jumpsForSpeedChange;
    /* 0x24 */ f32 clockSpeedMultiplier;
    /* 0x28 */ s8 finished;
    /* 0x29 */ char unk29[0x33];
} MinigameData; // Size 0x5C

#define PLAYER_STAT_01 1
#define PLAYER_STAT_JUMPING 2
#define PLAYER_STAT_LOST 8
#define PLAYER_STAT_WON 0x10
#define PLAYER_STAT_FROZEN 0x20
#define PLAYER_STAT_FINISHED (PLAYER_STAT_LOST | PLAYER_STAT_WON)

#define PLAYER_STATE_IDLE 0
#define PLAYER_STATE_WALK 2
#define PLAYER_STATE_JUMP 6
#define PLAYER_STATE_WON 13
#define PLAYER_STATE_KNOCKED 14
#define PLAYER_STATE_LAND 21
#define PLAYER_STATE_LOST 38

typedef struct {
    /* 0x00 */ s16 padId;
    /* 0x02 */ s16 chr;
    /* 0x04 */ s32 stat;
    /* 0x08 */ s8 updateAnimation;
    /* 0x0A */ s16 state;
    /* 0x0C */ s16 nextState;
    /* 0x0E */ char unk0E[0x12];
    /* 0x20 */ s16 resetInputGroupId;
    /* 0x22 */ s16 resetInputId;
    /* 0x24 */ s16 unk24;
    /* 0x26 */ char unk26[0x1A];
    /* 0x40 */ ModelTracker* obstacleCollisionTracker;
    /* 0x44 */ ModelTracker* obstacleProximityTracker;
    /* 0x48 */ f32 accelY;
    /* 0x4C */ s16 comReactionDelay;
    /* 0x4E */ s16 comShortJumpBias;
    /* 0x50 */ s16 comFreezeThreshold;
    /* 0x52 */ s16 dustBillId;
    /* 0x54 */ char unk54[8];
} PlayerData; // Size 0x5C

void o39_InitEnvironment(void);
void o39_CreateMinigame(void);
void o39_CheckExitRequest(omObjData* object);
void o39_ExitOverlay(omObjData* object);
void o39_WaitExitWipeOut(omObjData* object);
void o39_InitMinigame(omObjData* object);
void o39_UpdateSystem(omObjData* object);
void o39_InitClock(omObjData* object);
void o39_UpdateClockHands(omObjData* object);
void o39_InitPlayer(omObjData* object);
void o39_UpdatePlayer(omObjData* object);
void o39_InitCamera(FuncGroupData* groupData, FuncWork* work);
void o39_CheckMinigameEnd(FuncGroupData* groupData, FuncWork* work);
void o39_ExecPlayersDraw(FuncGroupData* groupData, FuncWork* work);
void o39_ExecClockIntro(FuncGroupData* groupData, FuncWork* work);
void o39_UpdateClockSpeed(FuncGroupData* groupData, FuncWork* work);
void o39_UpdateClockObstacleRotation(FuncGroupData* groupData, FuncWork* work);
void o39_UpdateClockPlatformRotation(FuncGroupData* groupData, FuncWork* work);
