#include "ultra64.h"
#include "overlays/minigame.h"
#include "game/audio.h"
#include "game/camera.h"
#include "game/esprite.h"
#include "game/gamemes.h"
#include "game/gamework_data.h"
#include "game/hmflight.h"
#include "game/hmfman.h"
#include "game/object.h"
#include "game/pause.h"
#include "game/sprite.h"
#include "game/util.h"
#include "game/wipe.h"
#include "include_asm.h"

#define BSS __attribute__((section(".bss")))

// EXTERN

typedef struct {
    /* 0x00 */ char unk00[4];
    /* 0x04 */ s16 unk04;
    /* 0x06 */ char unk06[0x1E];
} D_800CD1DC_CDDDC_Struct; // Size 0x24

// C1F0
void func_8000B5F0_C1F0(u8 arg0);
void func_8000B710_C310(s32);

// 14EA0
void func_800142A0_14EA0(s32);
s32 func_80016784_17384(s32, s32);
void func_80016FB4_17BB4(s32, s32, s16);
void func_80017320_17F20(s32);
s16 func_80017790_18390(s16 model, s32 arg1, s16 arg2, s32 arg3);
void func_80017954_18554(s32, s32, s16, s32);
s16 func_80017AD8_186D8(s32);
s32 func_80017BB8_187B8(s16, s16);

// 8EA10
f32 atan2d(f32, f32);

// 8EFF0
f32 HuMathCos(f32);

// 8FB20
f32 HuMathSin(f32);

// esprite
extern D_800CD1DC_CDDDC_Struct* D_800CD1DC_CDDDC;

// pad
extern u16 D_800D5558_D6158[];

// save
s32 _CheckFlag(s32);

// unknown
extern s8 D_800CD280_CDE80;
extern u16 D_800D530C_D5F0C;

extern Gfx* gMainGfxPos;

// LOCAL

typedef struct {
    /* 0x00 */ s8 unk00;
    /* 0x01 */ s8 unk01;
    /* 0x02 */ s8 unk02;
    /* 0x03 */ s8 unk03;
    /* 0x04 */ s8 unk04;
    /* 0x05 */ char unk05[1];
    /* 0x06 */ s16 unk06;
    /* 0x08 */ s16 unk08;
    /* 0x0C */ s32 unk0C;
} D_80115510_285FE0_Struct; // Size 0x10

// Required to align BSS.
typedef struct {
    s16 unk00[17];
    u8 unk22[8];
} D_80115640_286110_Struct;

void func_80105D08_2767D8_vine_with_me(omObjData* arg0);
void func_80106004_276AD4_vine_with_me(omObjData* arg0);
void func_8010683C_27730C_vine_with_me(omObjData* arg0);
void func_80106F1C_2779EC_vine_with_me(omObjData* arg0);
void func_801087BC_27928C_vine_with_me(void);
void func_8010ADB0_27B880_vine_with_me(Gfx** arg0, s32 arg1, s32 arg2);
void func_8010CEA8_27D978_vine_with_me(omObjData* arg0);
void func_8010CEE0_27D9B0_vine_with_me(omObjData* arg0);
void func_8010CF18_27D9E8_vine_with_me(omObjData* arg0, s8 arg1, s32 arg2);
void func_8010D46C_27DF3C_vine_with_me(omObjData* arg0);
void func_8010D48C_27DF5C_vine_with_me(omObjData* arg0);
void func_8010D4AC_27DF7C_vine_with_me(omObjData* arg0, s8 arg1, s8 arg2);

f32 BSS D_80112590_283060_vine_with_me[2];
f32 BSS D_80112598_283068_vine_with_me[2];
