#include "overlays/ovl_37.h"
#include "overlays/minigame.h"
#include "gcc/memory.h"
#include "game/audio.h"
#include "game/camera.h"
#include "game/gamemes.h"
#include "game/gamework_data.h"
#include "game/hmflight.h"
#include "game/hmfman.h"
#include "game/pause.h"
#include "game/util.h"
#include "game/wipe.h"
#include "mallocblock.h"
#include "include_asm.h"

#define ABS(x) ((x) > 0 ? (x) : -(x))

#define FPS 30.0f

#define PLAYERS_TOTAL 2
#define SIGNS_TOTAL 2
#define SCREWS_TOTAL 6
#define NUTS_TOTAL 6

#define GOAL_POS_X 200.0f
#define JUMP_RANGE_X 25.0f

// C1F0
void func_8000B5F0_C1F0(u8 arg0);
s32 func_8000B710_C310(s32 arg0);

// 14EA0
void func_800142A0_14EA0(s32);
s16 func_80017790_18390(s16 model, s32 arg1, s32 arg2, s32 arg3);
s32 func_80017BB8_187B8(s32, s32);

// 20A20
void Hu3DAnimInit(s32);

// 8FB20
f32 HuMathSin(f32);

// pad
extern u16 D_800CDA7C_CE67C[];
extern u16 D_800D5558_D6158[];

// printfunc
s32 print8(u16 x, u16 y, char* src);

// unknown
extern s32 D_800A178C[][6];
extern char D_800D5218_D5E18[];
extern u16 D_800D530C_D5F0C;

// LOCAL

enum {
    FGRP_CAMERA,
    FGRP_MINIGAME,
    FGRP_NUTS_1,
    FGRP_NUTS_2,
    FGRP_PLAYER_1,
    FGRP_PLAYER_2
};

enum {
    MDL_ARROW = 9,
    MDL_BALLOON_B,
    MDL_BALLOON_A
};

enum {
    CUE_ARROW,
    CUE_BALLOON_B,
    CUE_BALLOON_A
};

typedef struct {
    /* 0x00 */ s16 modelId;
    /* 0x04 */ f32 startPosX;
} NutData; // Size 8

typedef struct {
    /* 0x00 */ s16 wallCount;
    /* 0x02 */ s16 screwCount;
    /* 0x04 */ NutData* nuts;
    /* 0x08 */ char unk08[4];
} PlayerWorld; // Size 0xC

typedef struct {
    /* 0x00 */ PlayerWorld* worlds;
    /* 0x04 */ s8 unk04;
    /* 0x08 */ f32 timer; // counted in frames
    /* 0x0C */ Work work;
} MinigameData; // Size 0x3C

#define PLAYER_STATE_ON_PLATFORM 0
#define PLAYER_STATE_1 1
#define PLAYER_STATE_ROTATE 2
#define PLAYER_STATE_TRANSITION 3
#define PLAYER_STATE_JUMP 4
#define PLAYER_STATE_FINISHED 5
#define PLAYER_STATE_WON 6
#define PLAYER_STATE_7 7
#define PLAYER_STATE_WAIT_CAM 8

#define PLAYER_ANIM_IDLE 0
#define PLAYER_ANIM_WALK 1
#define PLAYER_ANIM_RUN 2
#define PLAYER_ANIM_JUMP 6
#define PLAYER_ANIM_WON 13
#define PLAYER_ANIM_LOST 14
#define PLAYER_ANIM_32 32

enum {
    PLAYER_DIR_RIGHT,
    PLAYER_DIR_LEFT
};

typedef struct {
    /* 0x00 */ omObjData* object;
    /* 0x04 */ s16 padId;
    /* 0x08 */ f32 startPosX;
    /* 0x0C */ s16 state;
    /* 0x0E */ s16 direction;
    /* 0x10 */ s8 unk10;
    /* 0x11 */ s8 inputIdleTimer;
    /* 0x12 */ s8 inputEnabled;
    /* 0x13 */ s8 cuesEnabled;
    /* 0x14 */ s8 finished;
    /* 0x15 */ s8 lost;
    /* 0x18 */ f32 speed;
    /* 0x1C */ s8 currNutId;
    /* 0x20 */ f32 accelY;
    /* 0x24 */ s16 nutSeNo;
    /* 0x26 */ s8 nutSeActive;
    /* 0x28 */ Work work;
} PlayerData; // Size 0x58

void m255_InitEnvironment(void);
void m255_CreateMinigame(void);
void m255_CheckExitRequest(omObjData* object);
void m255_WaitExitWipeOut(omObjData* object);
void m255_ExitOverlay(omObjData* object);
void m255_InitMinigame(omObjData* object);
void m255_UpdateSystem(omObjData* object);
void m255_CreateWall(omObjData* object);
void m255_UpdateWall(omObjData* object);
void m255_CreateSigns(omObjData* object);
void m255_UpdateSigns(omObjData* object);
void m255_CreateScrews(omObjData* object);
void m255_UpdateScrews(omObjData* object);
void m255_CreateNuts(omObjData* object);
void m255_UpdateNuts(omObjData* object);
void m255_InitPlayer(omObjData* object);
void m255_UpdatePlayer(omObjData* object);
void m255_InitCamera(FuncContext* ctx);
void m255_FollowPlayerWithCamera(FuncContext* ctx);
void m255_ExecMinigameIntro(FuncContext* ctx);
void m255_ExecPlayersDraw(FuncContext* ctx);
void m255_CheckMinigameEnd(FuncContext* ctx);
